Tekla Open API Reference for Tekla Structures 2025
Assembly Properties
The Assembly type exposes the following members.
Properties
Name | Description
AssemblyNumber
 Defines the numbering in the assembly sense. If the members are empty and zero, the main part attributes are used.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the assembly.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace